import math
# Задача 1
# Задайте список из нескольких чисел.Напишите программу, которая найдёт сумму
# элементов списка,стоящих на нечётной позиции.
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# array = [2, 3, 5, 9, 3, 4, 6, 7]
#
# def sumarr(arr):
#     res = 0
#     for i in range(len(arr)):
#         if i % 2 != 0:
#             res = res + arr[i]
#     return res
#
#
# result = sumarr(array)
# print(result)

# ------------------------------------------------------------------------------------------------------------------------
# Задача 2
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний
# элемент, второй и предпоследний и т.д.
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# array = [2, 3, 5, 9, 3, 4, 6, 7]
#
#
# def pair(arr):
#     a = []
#     j = len(arr) - 1
#     for i in range(len(arr)):
#         if i <= j:
#             a.append(arr[i] * arr[j])
#             j -= 1
#     return a
#
#
# result = pair(array)
# print(result)

# ------------------------------------------------------------------------------------------------------------------------
# Задача 3
# Задайте список из вещественных чисел. Напишите программу,
# которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19


# array = [1.1, 1.2, 3.1, 5, 10.01]
#
#
# def minmax(arr):
#     a = []
#     for el in arr:
#         if el % 1 != 0:
#             a.append(el % 1)
#     max = a[0]
#     min = a[0]
#     for el in a:
#         if el > max:
#             max = el
#     for el in a:
#         if el < min:
#             min = el
#     res = round((max - min), 2)
#     return res
#
#
# result = minmax(array)
# print(result)

# ------------------------------------------------------------------------------------------------------------------------
# Задача 4
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10


# number = int(input('Введите число: '))
#
#
# def reverse(num):
#     a = []
#     res = 0
#     if num == 0:
#         return res
#     if num > 0:
#         while num >= 1:
#             if num % 2 == 0:
#                 a.append('0')
#             else:
#                 a.append('1')
#             num = math.floor(num / 2)
#         a.reverse()
#         res = int("".join(a))
#         return res
#     if num < 0:
#         while num <= -1:
#             if num % 2 == 0:
#                 a.append('0')
#             else:
#                 a.append('1')
#             num = math.ceil(num / 2)
#         a.reverse()
#         res = -(int("".join(a)))
#         return res
#
#
# result = reverse(number)
# print(result)

# ------------------------------------------------------------------------------------------------------------------------
# Задача 5
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

# number = int(input('Введите число: '))
#
#
# def fibonnachi(num):
#     f1 = 1
#     f2 = 1
#     f_1 = 1
#     f_2 = -1
#     a = []
#     b = []
#     i = 0
#     j = 0
#     while j < num - 2:
#         f1_sum = f_2 - f_1
#         f_2 = f_1
#         f_1 = f1_sum
#         j += 1
#         b.append(-f_1)
#     b.reverse()
#     a.extend(b)
#     a.extend([-1, 1, 0, 1, 1])
#     while i < num - 2:
#         f_sum = f1 + f2
#         f1 = f2
#         f2 = f_sum
#         i += 1
#         a.append(f2)
#     return a
#
#
# result = fibonnachi(number)
# print(result)

