# Задайте список из вещественных чисел. Напишите программу,
# которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# - [1.1, 1.2, 3.1, 5.4, 10.01] => 0.39
# было:

# array = [1.1, 1.2, 3.1, 5.4, 10.01]
#
#
# def minmax(arr):
#     a = []
#     for el in arr:
#         if el % 1 != 0:
#             a.append(el % 1)
#     max = a[0]
#     min = a[0]
#     for el in a:
#         if el > max:
#             max = el
#     for el in a:
#         if el < min:
#             min = el
#     res = round((max - min), 2)
#     return res
#
#
# result = minmax(array)
# print(result)

# -------------------------------------------------------------------------------------------------------------------------------------------------------------------
# cтало:

array = [1.1, 1.2, 3.1, 5.4, 10.01]
digit = list(map(lambda el: el % 1, array))
res = round((max(digit) - min(digit)), 2)
print(res)
