# 3
# Задайте список из нескольких чисел.Напишите программу, которая найдёт сумму
# элементов списка,стоящих на нечётной позиции.
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
# было:

# array = [2, 3, 5, 9, 3, 4, 6, 7]
#
# def sumarr(arr):
#     res = 0
#     for i in range(len(arr)):
#         if i % 2 != 0:
#             res = res + arr[i]
#     return res
#
#
# result = sumarr(array)
# print(result)
# -------------------------------------------------------------------------------------------------------------------------------------------------------------------
# стало:

data = [2, 3, 5, 9, 3, 4, 6, 7, 1]
data = [i for i in data if i % 2 == 1]
res = sum(data)
print(res)
